Repository: westie-ai/session-bell
Catalog: ios/Shared/Localizable.xcstrings
Source language: en
Languages: zh_hans

# %@ ⤷ 正在进行：%@ （锁屏卡片可直接批准，或长按这条通知）
source: %@ ⤷ In progress: %@ (Approve from the Lock Screen card, or long-press this notification)
zh_hans: %@ ⤷ 正在进行：%@ （锁屏卡片可直接批准，或长按这条通知）

# %@ （锁屏卡片可直接批准，或长按这条通知）
source: %@ (Approve from the Lock Screen card, or long-press this notification)
zh_hans: %@ （锁屏卡片可直接批准，或长按这条通知）

source: %@ (tap to copy)
zh_hans: %@（点按拷贝）

source: %lld more (see all in the app)
zh_hans: 还有 %lld 个（App 内查看全部）

source: %lld tasks
zh_hans: %lld 个任务

source: %lld tasks running
zh_hans: %lld 个任务运行中

source: %lld tasks waiting for you
zh_hans: %lld 个任务在等你

source: %lldd %lldh
zh_hans: %lld天%lld时

source: %lldh
zh_hans: %lld时

source: %lldh %lldm
zh_hans: %lld时%lld分

source: %lldm
zh_hans: %lld分

source: 5-Hour Window
zh_hans: 5 小时窗口

source: A phone command center for Claude Code and other local coding agents
zh_hans: Claude Code 等本地编程 agent 的 手机指挥台

source: About
zh_hans: 关于

source: Active
zh_hans: 进行中

source: After a task runs on your Mac, this shows the official weekly quota and premium-model usage, same source as /usage.
zh_hans: Mac 上跑过任务后,这里显示官方口径的本周额度和高级模型用量,与 /usage 同源。

source: All done
zh_hans: 全部完成

source: Allow
zh_hans: 允许

source: Allow or deny without going back to the Mac
zh_hans: 允许 / 拒绝,不用回电脑

source: Allowed
zh_hans: 已开启

source: Applying…
zh_hans: 生效中…

source: Approval Needed
zh_hans: 待批准

source: Approve Permission
zh_hans: 批准授权

source: Approve permission requests from the Lock Screen
zh_hans: 授权请求锁屏一键批准

source: Asks nothing and runs straight through. The first time on a machine you must accept a warning on the Mac.
zh_hans: 什么都不问,一路到底;该机器首次需在电脑上接受一次警告

source: Auto mode: safe actions pass automatically, doubtful ones go to your phone (recommended)
zh_hans: auto mode:安全操作自动过,存疑的推手机批准(推荐)

source: Awake
zh_hans: 常亮中

source: Back
zh_hans: 返回

source: Backend (not set)
zh_hans: 后端配置(未设置)

source: Backend not configured
zh_hans: 后端未配置

source: Backend: %@
zh_hans: 后端:%@

source: Cancel
zh_hans: 取消

source: Captured %@ ago
zh_hans: 画面时间:%@前

source: Claude is requesting permission
zh_hans: Claude 请求授权

# Claude 在等待你的输入或授权
source: Claude is waiting for your input or approval
zh_hans: Claude 在等待你的输入或授权

# Claude 已完成本轮任务
source: Claude finished this turn
zh_hans: Claude 已完成本轮任务

source: Clear
zh_hans: 清空

source: Computers
zh_hans: 电脑

source: Connect
zh_hans: 连接

source: Connect Later
zh_hans: 稍后连接

source: Connect Mac
zh_hans: 连接 Mac

source: Connected to %@ 🎉
zh_hans: 已连接 %@ 🎉

source: Connection
zh_hans: 连接状态

source: Copied ✓
zh_hans: 已拷贝 ✓

source: Copied ✓ Press ⌘V on a Mac with the same Apple Account
zh_hans: 已拷贝 ✓ 同一 Apple 账号的 Mac 直接 ⌘V

source: Copy Pair Command (add another Mac)
zh_hans: 拷贝配对命令(接入新电脑)

source: Copy the pair command, paste it in Terminal on the Mac and press Return
zh_hans: 拷贝配对命令,到 Mac 终端里粘贴回车

source: Couldn't find that Mac. Not sent.
zh_hans: 找不到那台电脑,没发出去

source: Couldn't parse the pairing code. Contact the person who invited you.
zh_hans: 配对码解析失败,请联系邀请你的人

source: Create My Space
zh_hans: 创建我的空间

source: Creating your space…
zh_hans: 正在创建空间…

source: Default
zh_hans: 普通

source: Demo data
zh_hans: 演示数据

source: Demo mode · Create My Space
zh_hans: 演示模式 · 创建我的空间

source: Denied (enable in Settings)
zh_hans: 已拒绝（去设置打开）

source: Deny
zh_hans: 拒绝

source: Deployment guide at github.com/westie-ai/session-bell
zh_hans: 部署指南见 github.com/westie-ai/session-bell

source: Done
zh_hans: 已完成

source: Download and install SessionBell.pkg
zh_hans: 下载并安装 SessionBell.pkg

source: Ended
zh_hans: 已结束

source: Every permission goes to your phone for approval. Safest.
zh_hans: 所有授权推手机批准,最稳

source: Failed: %@
zh_hans: 失败: %@

source: Finish setup first. Tasks will show up here once a Mac connects.
zh_hans: 先完成接入,Mac 连上来之后任务会出现在这里。

source: Finished
zh_hans: 完成

source: First Instruction
zh_hans: 第一条指令

source: Get Started
zh_hans: 开始使用

source: Give an agent a job on your Mac. Tasks appear here and on the Lock Screen in real time, and your phone rings when they finish.
zh_hans: 在 Mac 上给 agent 派个活:任务会实时出现在这里和锁屏上,完成时手机响铃。

source: Have a Pairing Code
zh_hans: 有配对码

source: Have a pairing code / self-hosted
zh_hans: 已有配对码 / 自托管

source: Hide Keyboard
zh_hans: 收起键盘

source: Invalid address
zh_hans: 地址不合法

source: Keep Awake
zh_hans: 防熄屏

source: Live Activity Start Token
zh_hans: Live Activity 启动 Token

source: Needs Attention
zh_hans: 需要干预

source: Network error: %@
zh_hans: 网络不通:%@

source: New Session
zh_hans: 新建 session

source: No Tasks Yet
zh_hans: 还没有任务

source: No Usage Data
zh_hans: 暂无用量数据

source: No active tasks right now
zh_hans: 当前没有活跃任务

source: No backend configured
zh_hans: 没有后端配置

source: No frame yet — that Mac may be offline, or the terminal window was closed
zh_hans: 暂无画面 — 那台电脑可能不在线,或终端窗口已关

source: Not asked yet
zh_hans: 未询问

source: Not connected yet? Check in order:
zh_hans: 还没连上?按顺序检查:

source: Notification History
zh_hans: 通知历史

source: Notification History (%lld)
zh_hans: 通知历史(%lld 条)

source: Notifications
zh_hans: 通知权限

source: On the Mac (two steps)
zh_hans: 在 Mac 上(两步)

source: One Lock Screen panel for every Mac
zh_hans: 锁屏面板聚合所有 Mac 的任务

source: Open SessionBell
zh_hans: 进入 SessionBell

source: Or type a path
zh_hans: 或手动输入路径

source: Panel ready, waiting for task events
zh_hans: 面板已就绪，等待任务事件

source: Panel revived ✓
zh_hans: 面板已唤起 ✓

source: Paste pairing code
zh_hans: 粘贴配对码

source: Paste pairing code (fills in below)
zh_hans: 粘贴配对码(自动填充下方)

source: Permission Mode
zh_hans: 权限模式

source: Permission Request
zh_hans: 请求授权

source: Phone
zh_hans: 手机

source: Premium Model
zh_hans: 高级模型

source: Project Folder
zh_hans: 项目目录

source: Refreshing…
zh_hans: 刷新中…

source: Restricted
zh_hans: 受限

source: Revive Lock Screen Panel
zh_hans: 唤起锁屏面板

source: Reviving…
zh_hans: 唤起中…

source: Running
zh_hans: 运行中

source: Save
zh_hans: 保存

source: Saved ✓
zh_hans: 已保存 ✓

source: Self-Hosted
zh_hans: 自托管

source: Send
zh_hans: 发送

source: Sent · picked up when the task is idle
zh_hans: 已发出 · 任务空闲时自动接上

source: Sent. Starting in about 10 seconds
zh_hans: 已发送,约 10 秒后启动

source: Server returned HTTP %lld
zh_hans: 服务器返回 HTTP %lld

source: Settings
zh_hans: 设置

source: Setup
zh_hans: 接入

source: Shared secret (SB_SECRET)
zh_hans: 共享密钥(SB_SECRET)

source: Show Setup Guide Again
zh_hans: 重新打开接入引导

source: Source Code · westie-ai/session-bell
zh_hans: 开源仓库 · westie-ai/session-bell

source: Start Setup
zh_hans: 开始接入

source: Starts an interactive session in a new Otty window on that Mac, so you can take over when you're back at the desk. The task shows up on the panel and the result is pushed when it finishes. If Otty isn't running, it falls back to headless execution in the background.
zh_hans: 在那台电脑的 Otty 新窗口里启动交互式 session——回到桌面即可接管;任务出现在面板上,完成推送结果。Otty 未运行时自动改为后台无头执行。

source: Stays quiet while you're at the Mac
zh_hans: 在电脑前时不会吵你

source: Task Finished
zh_hans: 任务完成

source: Tasks
zh_hans: 任务

source: Tenant secret
zh_hans: 租户密钥

source: Terminal Mode (live output + input)
zh_hans: 终端模式(实时输出 + 输入)

source: Test
zh_hans: 测试

source: Test Connection
zh_hans: 测试连接

source: The base64 string generated by the person who invited you. Paste it and you're done.
zh_hans: 邀请你的人生成的那串 base64。粘上即自动完成。

source: The demo isn't available right now.
zh_hans: 演示暂时不可用。

source: These tasks are simulated. Create your own space and connect your Mac to see the real thing.
zh_hans: 这些任务是模拟的。创建自己的空间并连接 Mac,这里就会显示真实任务。

source: This Device
zh_hans: 本机

source: Today %@ · This cycle %@
zh_hans: 今日 %@ · 本周期 %@

source: Too many sign-ups from this network. Try again in an hour.
zh_hans: 这个网络注册太频繁,一小时后再试。

source: Try the demo first
zh_hans: 先看看演示

source: Type straight into the terminal…
zh_hans: 直接打进终端…

source: Typed into terminal
zh_hans: 已打进终端

source: Universal Clipboard carries it to the Mac after copying. AirDrop works too.
zh_hans: 拷贝后靠通用剪贴板直达 Mac;也可以用隔空投送把命令发过去。

source: Unknown project
zh_hans: 未知项目

source: Usage
zh_hans: 用量

source: Version
zh_hans: 版本

source: Waiting / running / done, with live timers
zh_hans: 等待 / 运行 / 完成,实时走秒

source: Waiting for APNs registration… (requires a real device with notifications allowed)
zh_hans: 等待 APNs 注册…（需要真机运行并允许通知）

source: Waiting for the Mac's first heartbeat…
zh_hans: 等待 Mac 的第一个心跳…

source: Waiting for you
zh_hans: 等待你

source: Waiting, finished, or needs approval — pushed straight to you
zh_hans: 任务等你、跑完、要授权 — 推送直达

source: Weekly Quota
zh_hans: 本周额度

source: What should it do…
zh_hans: 让它做什么…

source: What's next…
zh_hans: 下一步做什么…

source: Your Agents, on the Lock Screen
zh_hans: 把 Agent 装进锁屏

source: https://your-worker-address
zh_hans: https://你的 Worker 地址

source: official figures
zh_hans: 官方口径

source: resets in %@
zh_hans: 距重置 %@

source: sub-agent
zh_hans: 子 agent

# ⏳ %@ 个任务运行中
source: ⏳ %@ tasks running
zh_hans: ⏳ %@ 个任务运行中

source: ⏳ Connecting to terminal… (first frame in about 10 s)
zh_hans: ⏳ 正在连接终端…(首帧约 10 秒)

source: ⏳ Fetching latest frame… (about 10 s)
zh_hans: ⏳ 正在取最后画面…(约 10 秒)

source: ⏳ Testing connection…
zh_hans: ⏳ 测试连接…

source: ⏳ Testing…
zh_hans: ⏳ 测试中…

source: ① Is the pkg installed? (The sessionbell command only exists after that.) ② Was the whole command pasted? (It's long, don't truncate it.) ③ Did you allow every permission prompt on the Mac?
zh_hans: ① pkg 装完了吗(装完终端里才有 sessionbell 命令) ② 命令是完整粘贴的吗(很长,别截断) ③ Mac 弹的权限框都点了允许吗

# ✅ %@ · 任务完成
source: ✅ %@ · Task finished
zh_hans: ✅ %@ · 任务完成

# ✅ %@ · 完成「%@」
source: ✅ %@ · Finished “%@”
zh_hans: ✅ %@ · 完成「%@」

source: ✅ Allow
zh_hans: ✅ 允许

source: ✅ Connected to %@
zh_hans: ✅ 已连接 %@

source: ❌ Deny
zh_hans: ❌ 拒绝

source: ❌ Invalid address: %@
zh_hans: ❌ 地址不合法: %@

source: ❌ No backend configured
zh_hans: ❌ 未配置后端

# 推送链路打通了！
source: Push notifications are working!
zh_hans: 推送链路打通了！

source: 💬 Reply
zh_hans: 💬 回复指令

# 🔐 %@ · 请求授权
source: 🔐 %@ · Permission request
zh_hans: 🔐 %@ · 请求授权

# 🔔 SessionBell 测试
source: 🔔 SessionBell test
zh_hans: 🔔 SessionBell 测试

# 🖐 %@ · 需要你
source: 🖐 %@ · Needs you
zh_hans: 🖐 %@ · 需要你

# 🖐 %@ 个任务在等你
source: 🖐 %@ tasks waiting for you
zh_hans: 🖐 %@ 个任务在等你

source: 🚀 Start on %@
zh_hans: 🚀 在 %@ 上启动

source: Feedback
zh_hans: 反馈

source: Bug
zh_hans: 问题

source: Idea
zh_hans: 建议

source: Type
zh_hans: 类型

source: What happened, or what would make SessionBell better?
zh_hans: 遇到了什么问题，或者希望 SessionBell 怎么改？

source: Sent with your app version and iOS version so we can reproduce it. No session content is included.
zh_hans: 会附带 App 版本和 iOS 版本以便复现，不包含任何会话内容。

source: How can we reach you?
zh_hans: 怎么联系你？

source: Couldn't send right now. Try again, or email us directly.
zh_hans: 暂时发送失败，请重试，或直接发邮件给我们。

source: Email %@
zh_hans: 发邮件至 %@

source: Send Feedback
zh_hans: 发送反馈

source: Thanks! Feedback sent.
zh_hans: 已收到，谢谢！

source: OK
zh_hans: 好

source: SessionBell pairs with your Mac
zh_hans: SessionBell 需要和你的 Mac 配对

source: It puts the Claude Code sessions running on your Mac onto this phone's Lock Screen. The next step is one line in the Mac's Terminal — about 30 seconds.
zh_hans: 它把 Mac 上正在跑的 Claude Code 搬到这台手机的锁屏。下一步要在 Mac 的终端里粘一行命令，大约 30 秒。

source: I'm at my Mac now
zh_hans: 我现在就在 Mac 前

source: Not right now — show me the demo
zh_hans: 现在不在，先看看演示

source: My Mac is showing a 6-digit code
zh_hans: Mac 屏幕上有一个 6 位数字

source: Later
zh_hans: 稍后

source: Paste this one line into Terminal on your Mac and press Return
zh_hans: 把这一行粘到 Mac 的终端里，按回车

source: Copied — now ⌘V on the Mac
zh_hans: 已复制，去 Mac 上 ⌘V

source: Copy the line
zh_hans: 复制这一行

source: Can't copy across? Just type it — the number is %@. Valid for 15 minutes; it renews by itself.
zh_hans: 复制不过去？照着敲也行，数字是 %@。15 分钟内有效，过期会自动换新的。

source: On the Mac
zh_hans: 在 Mac 上

source: Terminal is in Applications › Utilities, or press ⌘Space and type Terminal.
zh_hans: 终端在「应用程序 › 实用工具」里，或者按 ⌘空格 输入 Terminal。

source: From now on, when Claude Code stops and waits for you, a card shows up on this Lock Screen.
zh_hans: 从现在起，Claude Code 停下来等你时，这台手机的锁屏上会出现一张卡片。

source: Waiting for the Mac… this page moves on by itself once it's done.
zh_hans: 等 Mac 那边跑完……好了这页会自己跳走。

source: Nothing yet? Make sure the whole line was pasted and you pressed Return. If the Mac asked for permission, allow it.
zh_hans: 还没反应？确认整行都粘进去了、按了回车。Mac 如果弹出权限询问，点允许。

source: Then
zh_hans: 然后

source: Connect your Mac
zh_hans: 连接 Mac

source: Connecting…
zh_hans: 连接中……

source: The 6 digits on the Mac screen
zh_hans: Mac 屏幕上的 6 位数字

source: They appear in Terminal and in the browser page that opened after the command finished. Scanning that page's QR code with the Camera app fills this in for you.
zh_hans: 命令跑完后终端里和自动打开的网页上都有。用相机扫那个网页上的二维码，这里会自动填好。

source: I have a long pairing code or a self-hosted server
zh_hans: 我有一长串配对码 / 自己部署的服务器

source: Enter the code
zh_hans: 输入数字

source: your Mac
zh_hans: 你的 Mac

source: Your Mac isn't connected yet
zh_hans: 你的 Mac 还没接上

source: One line in Terminal and your Claude Code sessions land on this Lock Screen.
zh_hans: 终端里粘一行命令，Claude Code 的会话就会出现在这块锁屏上。

source: Enter the 6 digits shown on the Mac.
zh_hans: 输入 Mac 上显示的 6 位数字。

source: The Mac sent something unexpected. Run the command on the Mac again.
zh_hans: Mac 返回的内容不对。在 Mac 上重新跑一遍那行命令。

source: This code was already used. Run the command on the Mac again for a new one.
zh_hans: 这个数字已经用过了。在 Mac 上重新跑一遍命令，会给一个新的。

source: This code expired or isn't right. Check the Mac screen and try again.
zh_hans: 这个数字过期了或者不对。看一眼 Mac 屏幕再试。

source: Too many tries. Wait a minute and try again.
zh_hans: 试得太多了，等一分钟再来。

source: Not connected to a Mac yet
zh_hans: 还没连上 Mac

source: These tasks are a demo. When you're back at your Mac, tap below — it's one line in Terminal, about 30 seconds.
zh_hans: 这些任务是演示数据。回到 Mac 前时点下面这个按钮，终端里粘一行命令，大约 30 秒。

source: Copied — paste it in Terminal on the other Mac (valid 15 min)
zh_hans: 已复制，粘到另一台 Mac 的终端里（15 分钟内有效）

source: Add another Mac (copy the one-line command)
zh_hans: 再加一台 Mac（复制那行命令）

source: Demo mode · Connect my Mac
zh_hans: 演示模式 · 连接我的 Mac

source: Connected. This card fills in when Claude Code next stops for you.
zh_hans: 已连接。Claude Code 下次停下来等你时，这张卡会显示具体任务。

source: Reset and Start Over
zh_hans: 重置并重新开始

source: Forgets the pairing on this phone and returns to the first screen, as if freshly installed. Your Macs keep their setup; pair again to reconnect them.
zh_hans: 忘掉这台手机上的配对，回到第一屏，就像刚装上一样。Mac 那边的设置保留，重新配对即可再接上。

source: Reset SessionBell on this phone?
zh_hans: 重置这台手机上的 SessionBell？

source: Pairing, history and Lock Screen cards on this phone are removed. Nothing is deleted on your Macs or the server.
zh_hans: 会清掉这台手机上的配对、历史记录和锁屏卡片。Mac 和服务器上的东西不会被删。

source: Self-hosted server / advanced
zh_hans: 自己部署的服务器 / 高级选项

source: Enter the 6 digits from the Mac
zh_hans: 输入 Mac 上的那 6 位数字

source: Already ran a command on the Mac and it shows 6 digits?
zh_hans: Mac 上已经跑过这行命令、屏幕上出现了 6 位数字？

source: Digits from the Mac
zh_hans: Mac 上的数字

source: After the command finishes on the Mac, the digits are printed in Terminal and shown on the web page that opens. Scanning that page's QR code with the Camera app fills them in for you.
zh_hans: Mac 上命令跑完后，数字会打印在终端里，也显示在自动打开的网页上。用相机扫那个网页上的二维码，这里会自动填好。

source: Email or any handle — X, Discord… (optional)
zh_hans: 邮箱或微信（选填）

source: Send to the Mac with AirDrop instead
zh_hans: 改用 AirDrop 发到 Mac

source: Paste didn't arrive on the Mac? AirDrop opens a page there with a copy button. Or just type it — the number is %@. Valid for 15 minutes; it renews by itself.
zh_hans: Mac 上粘不出来？AirDrop 过去会打开一个带复制按钮的网页。或者照着敲，数字是 %@。15 分钟内有效，过期会自动换新的。

source: One line in Terminal on your Mac, about 30 seconds. Tap below when you're in front of it.
zh_hans: 在 Mac 的终端里粘一行命令，大约 30 秒。人到 Mac 前了就点下面。

source: Look up: the panel is already in the Dynamic Island. Lock the phone and it's on the Lock Screen too.
zh_hans: 抬头看，面板已经在灵动岛里了。锁上屏幕，锁屏上也有。

source: From now on it fills in whenever Claude Code stops and waits for you.
zh_hans: 从现在起，Claude Code 停下来等你时，它就会显示具体任务。

source: Switch this phone to another Mac?
zh_hans: 把这台手机切到另一台 Mac？

source: Switch and pair
zh_hans: 切换并配对

source: This phone is already paired. Entering the new code moves it to that Mac's space; the current Mac stops showing up until you pair it again.
zh_hans: 这台手机已经配过对了。输入新数字会把它切到那台 Mac 的空间，当前的 Mac 会消失，直到你再次配对它。

source: Advanced · Self-hosted
zh_hans: 高级 · 自托管

source: Connected Macs
zh_hans: 已连接的 Mac

source: Awake · tap to stop
zh_hans: 常亮中 · 点一下取消

source: Keep Mac awake
zh_hans: 保持 Mac 常亮

source: Start a task on this Mac
zh_hans: 在这台 Mac 上开新任务
